Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32F207/Includes/Registers/stm32F217_can.h
/*
 * SPDX-License-Identifier: MIT
 * SPDX-FileCopyrightText: 2025-2026 Edo. Franzi
 *
 * Generated using the .svd description
 * Goal:     stm32F217_can equates.
 */

#pragma once

#include    <stdint.h>

// CAN address definitions
// -----------------------

typedef struct {
    volatile    uint32_t    MCR;
    volatile    uint32_t    MSR;
    volatile    uint32_t    TSR;
    volatile    uint32_t    RF0R;
    volatile    uint32_t    RF1R;
    volatile    uint32_t    IER;
    volatile    uint32_t    ESR;
    volatile    uint32_t    BTR;
    volatile    uint32_t    RESERVED0[88];
    volatile    uint32_t    TI0R;
    volatile    uint32_t    TDT0R;
    volatile    uint32_t    TDL0R;
    volatile    uint32_t    TDH0R;
    volatile    uint32_t    TI1R;
    volatile    uint32_t    TDT1R;
    volatile    uint32_t    TDL1R;
    volatile    uint32_t    TDH1R;
    volatile    uint32_t    TI2R;
    volatile    uint32_t    TDT2R;
    volatile    uint32_t    TDL2R;
    volatile    uint32_t    TDH2R;
    volatile    uint32_t    RI0R;
    volatile    uint32_t    RDT0R;
    volatile    uint32_t    RDL0R;
    volatile    uint32_t    RDH0R;
    volatile    uint32_t    RI1R;
    volatile    uint32_t    RDT1R;
    volatile    uint32_t    RDL1R;
    volatile    uint32_t    RDH1R;
    volatile    uint32_t    RESERVED1[12];
    volatile    uint32_t    FMR;
    volatile    uint32_t    FM1R;
    volatile    uint32_t    RESERVED2;
    volatile    uint32_t    FS1R;
    volatile    uint32_t    RESERVED3;
    volatile    uint32_t    FFA1R;
    volatile    uint32_t    RESERVED4;
    volatile    uint32_t    FA1R;
    volatile    uint32_t    RESERVED5[8];
    volatile    uint32_t    F0R1;
    volatile    uint32_t    F0R2;
    volatile    uint32_t    F1R1;
    volatile    uint32_t    F1R2;
    volatile    uint32_t    F2R1;
    volatile    uint32_t    F2R2;
    volatile    uint32_t    F3R1;
    volatile    uint32_t    F3R2;
    volatile    uint32_t    F4R1;
    volatile    uint32_t    F4R2;
    volatile    uint32_t    F5R1;
    volatile    uint32_t    F5R2;
    volatile    uint32_t    F6R1;
    volatile    uint32_t    F6R2;
    volatile    uint32_t    F7R1;
    volatile    uint32_t    F7R2;
    volatile    uint32_t    F8R1;
    volatile    uint32_t    F8R2;
    volatile    uint32_t    F9R1;
    volatile    uint32_t    F9R2;
    volatile    uint32_t    F10R1;
    volatile    uint32_t    F10R2;
    volatile    uint32_t    F11R1;
    volatile    uint32_t    F11R2;
    volatile    uint32_t    F12R1;
    volatile    uint32_t    F12R2;
    volatile    uint32_t    F13R1;
    volatile    uint32_t    F13R2;
    volatile    uint32_t    F14R1;
    volatile    uint32_t    F14R2;
    volatile    uint32_t    F15R1;
    volatile    uint32_t    F15R2;
    volatile    uint32_t    F16R1;
    volatile    uint32_t    F16R2;
    volatile    uint32_t    F17R1;
    volatile    uint32_t    F17R2;
    volatile    uint32_t    F18R1;
    volatile    uint32_t    F18R2;
    volatile    uint32_t    F19R1;
    volatile    uint32_t    F19R2;
    volatile    uint32_t    F20R1;
    volatile    uint32_t    F20R2;
    volatile    uint32_t    F21R1;
    volatile    uint32_t    F21R2;
    volatile    uint32_t    F22R1;
    volatile    uint32_t    F22R2;
    volatile    uint32_t    F23R1;
    volatile    uint32_t    F23R2;
    volatile    uint32_t    F24R1;
    volatile    uint32_t    F24R2;
    volatile    uint32_t    F25R1;
    volatile    uint32_t    F25R2;
    volatile    uint32_t    F26R1;
    volatile    uint32_t    F26R2;
    volatile    uint32_t    F27R1;
    volatile    uint32_t    F27R2;
} CAN_TypeDef;

#ifdef __cplusplus
#define CAN2    reinterpret_cast<CAN_TypeDef *>(0x40006800U)
#define CAN1    reinterpret_cast<CAN_TypeDef *>(0x40006400U)

#else
#define CAN2    ((CAN_TypeDef *)0x40006800U)
#define CAN1    ((CAN_TypeDef *)0x40006400U)
#endif

// MCR Configuration

#define CAN_MCR_INRQ        (0x1U<<0)
#define CAN_MCR_SLEEP       (0x1U<<1)
#define CAN_MCR_TXFP        (0x1U<<2)
#define CAN_MCR_RFLM        (0x1U<<3)
#define CAN_MCR_NART        (0x1U<<4)
#define CAN_MCR_AWUM        (0x1U<<5)
#define CAN_MCR_ABOM        (0x1U<<6)
#define CAN_MCR_TTCM        (0x1U<<7)
#define CAN_MCR_RESET       (0x1U<<15)
#define CAN_MCR_DBF         (0x1U<<16)

// MSR Configuration

#define CAN_MSR_INAK        (0x1U<<0)
#define CAN_MSR_SLAK        (0x1U<<1)
#define CAN_MSR_ERRI        (0x1U<<2)
#define CAN_MSR_WKUI        (0x1U<<3)
#define CAN_MSR_SLAKI       (0x1U<<4)
#define CAN_MSR_TXM         (0x1U<<8)
#define CAN_MSR_RXM         (0x1U<<9)
#define CAN_MSR_SAMP        (0x1U<<10)
#define CAN_MSR_RX          (0x1U<<11)

// TSR Configuration

#define CAN_TSR_RQCP0       (0x1U<<0)
#define CAN_TSR_TXOK0       (0x1U<<1)
#define CAN_TSR_ALST0       (0x1U<<2)
#define CAN_TSR_TERR0       (0x1U<<3)
#define CAN_TSR_ABRQ0       (0x1U<<7)
#define CAN_TSR_RQCP1       (0x1U<<8)
#define CAN_TSR_TXOK1       (0x1U<<9)
#define CAN_TSR_ALST1       (0x1U<<10)
#define CAN_TSR_TERR1       (0x1U<<11)
#define CAN_TSR_ABRQ1       (0x1U<<15)
#define CAN_TSR_RQCP2       (0x1U<<16)
#define CAN_TSR_TXOK2       (0x1U<<17)
#define CAN_TSR_ALST2       (0x1U<<18)
#define CAN_TSR_TERR2       (0x1U<<19)
#define CAN_TSR_ABRQ2       (0x1U<<23)
#define CAN_TSR_CODE        (0x3U<<24)
#define CAN_TSR_CODE_0      (0x1U<<24)
#define CAN_TSR_TME0        (0x1U<<26)
#define CAN_TSR_TME1        (0x1U<<27)
#define CAN_TSR_TME2        (0x1U<<28)
#define CAN_TSR_LOW0        (0x1U<<29)
#define CAN_TSR_LOW1        (0x1U<<30)
#define CAN_TSR_LOW2        (0x1U<<31)

// RF0R Configuration

#define CAN_RF0R_FMP0       (0x3U<<0)
#define CAN_RF0R_FMP0_0     (0x1U<<0)
#define CAN_RF0R_FULL0      (0x1U<<3)
#define CAN_RF0R_FOVR0      (0x1U<<4)
#define CAN_RF0R_RFOM0      (0x1U<<5)

// RF1R Configuration

#define CAN_RF1R_FMP1       (0x3U<<0)
#define CAN_RF1R_FMP1_0     (0x1U<<0)
#define CAN_RF1R_FULL1      (0x1U<<3)
#define CAN_RF1R_FOVR1      (0x1U<<4)
#define CAN_RF1R_RFOM1      (0x1U<<5)

// IER Configuration

#define CAN_IER_TMEIE       (0x1U<<0)
#define CAN_IER_FMPIE0      (0x1U<<1)
#define CAN_IER_FFIE0       (0x1U<<2)
#define CAN_IER_FOVIE0      (0x1U<<3)
#define CAN_IER_FMPIE1      (0x1U<<4)
#define CAN_IER_FFIE1       (0x1U<<5)
#define CAN_IER_FOVIE1      (0x1U<<6)
#define CAN_IER_EWGIE       (0x1U<<8)
#define CAN_IER_EPVIE       (0x1U<<9)
#define CAN_IER_BOFIE       (0x1U<<10)
#define CAN_IER_LECIE       (0x1U<<11)
#define CAN_IER_ERRIE       (0x1U<<15)
#define CAN_IER_WKUIE       (0x1U<<16)
#define CAN_IER_SLKIE       (0x1U<<17)

