Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32F207/Includes/Registers/stm32F217_can.h
// ESR Configuration

#define CAN_ESR_EWGF        (0x1U<<0)
#define CAN_ESR_EPVF        (0x1U<<1)
#define CAN_ESR_BOFF        (0x1U<<2)
#define CAN_ESR_LEC         (0x7U<<4)
#define CAN_ESR_LEC_0       (0x1U<<4)
#define CAN_ESR_TEC         (0xFFU<<16)
#define CAN_ESR_TEC_0       (0x1U<<16)
#define CAN_ESR_REC         (0xFFU<<24)
#define CAN_ESR_REC_0       (0x1U<<24)

// BTR Configuration

#define CAN_BTR_BRP         (0x3FFU<<0)
#define CAN_BTR_BRP_0       (0x1U<<0)
#define CAN_BTR_TS1         (0xFU<<16)
#define CAN_BTR_TS1_0       (0x1U<<16)
#define CAN_BTR_TS2         (0x7U<<20)
#define CAN_BTR_TS2_0       (0x1U<<20)
#define CAN_BTR_SJW         (0x3U<<24)
#define CAN_BTR_SJW_0       (0x1U<<24)
#define CAN_BTR_LBKM        (0x1U<<30)
#define CAN_BTR_SILM        (0x1U<<31)

// TI0R Configuration

#define CAN_TI0R_TXRQ       (0x1U<<0)
#define CAN_TI0R_RTR        (0x1U<<1)
#define CAN_TI0R_IDE        (0x1U<<2)
#define CAN_TI0R_EXID       (0x3FFFFU<<3)
#define CAN_TI0R_EXID_0     (0x1U<<3)
#define CAN_TI0R_STID       (0x7FFU<<21)
#define CAN_TI0R_STID_0     (0x1U<<21)

// TDT0R Configuration

#define CAN_TDT0R_DLC       (0xFU<<0)
#define CAN_TDT0R_DLC_0     (0x1U<<0)
#define CAN_TDT0R_TGT       (0x1U<<8)
#define CAN_TDT0R_TIME      (0xFFFFU<<16)
#define CAN_TDT0R_TIME_0    (0x1U<<16)

// TDL0R Configuration

#define CAN_TDL0R_DATA0     (0xFFU<<0)
#define CAN_TDL0R_DATA0_0   (0x1U<<0)
#define CAN_TDL0R_DATA1     (0xFFU<<8)
#define CAN_TDL0R_DATA1_0   (0x1U<<8)
#define CAN_TDL0R_DATA2     (0xFFU<<16)
#define CAN_TDL0R_DATA2_0   (0x1U<<16)
#define CAN_TDL0R_DATA3     (0xFFU<<24)
#define CAN_TDL0R_DATA3_0   (0x1U<<24)

// TDH0R Configuration

#define CAN_TDH0R_DATA4     (0xFFU<<0)
#define CAN_TDH0R_DATA4_0   (0x1U<<0)
#define CAN_TDH0R_DATA5     (0xFFU<<8)
#define CAN_TDH0R_DATA5_0   (0x1U<<8)
#define CAN_TDH0R_DATA6     (0xFFU<<16)
#define CAN_TDH0R_DATA6_0   (0x1U<<16)
#define CAN_TDH0R_DATA7     (0xFFU<<24)
#define CAN_TDH0R_DATA7_0   (0x1U<<24)

// TI1R Configuration

#define CAN_TI1R_TXRQ       (0x1U<<0)
#define CAN_TI1R_RTR        (0x1U<<1)
#define CAN_TI1R_IDE        (0x1U<<2)
#define CAN_TI1R_EXID       (0x3FFFFU<<3)
#define CAN_TI1R_EXID_0     (0x1U<<3)
#define CAN_TI1R_STID       (0x7FFU<<21)
#define CAN_TI1R_STID_0     (0x1U<<21)

// TDT1R Configuration

#define CAN_TDT1R_DLC       (0xFU<<0)
#define CAN_TDT1R_DLC_0     (0x1U<<0)
#define CAN_TDT1R_TGT       (0x1U<<8)
#define CAN_TDT1R_TIME      (0xFFFFU<<16)
#define CAN_TDT1R_TIME_0    (0x1U<<16)

// TDL1R Configuration

#define CAN_TDL1R_DATA0     (0xFFU<<0)
#define CAN_TDL1R_DATA0_0   (0x1U<<0)
#define CAN_TDL1R_DATA1     (0xFFU<<8)
#define CAN_TDL1R_DATA1_0   (0x1U<<8)
#define CAN_TDL1R_DATA2     (0xFFU<<16)
#define CAN_TDL1R_DATA2_0   (0x1U<<16)
#define CAN_TDL1R_DATA3     (0xFFU<<24)
#define CAN_TDL1R_DATA3_0   (0x1U<<24)

// TDH1R Configuration

#define CAN_TDH1R_DATA4     (0xFFU<<0)
#define CAN_TDH1R_DATA4_0   (0x1U<<0)
#define CAN_TDH1R_DATA5     (0xFFU<<8)
#define CAN_TDH1R_DATA5_0   (0x1U<<8)
#define CAN_TDH1R_DATA6     (0xFFU<<16)
#define CAN_TDH1R_DATA6_0   (0x1U<<16)
#define CAN_TDH1R_DATA7     (0xFFU<<24)
#define CAN_TDH1R_DATA7_0   (0x1U<<24)

// TI2R Configuration

#define CAN_TI2R_TXRQ       (0x1U<<0)
#define CAN_TI2R_RTR        (0x1U<<1)
#define CAN_TI2R_IDE        (0x1U<<2)
#define CAN_TI2R_EXID       (0x3FFFFU<<3)
#define CAN_TI2R_EXID_0     (0x1U<<3)
#define CAN_TI2R_STID       (0x7FFU<<21)
#define CAN_TI2R_STID_0     (0x1U<<21)

// TDT2R Configuration

#define CAN_TDT2R_DLC       (0xFU<<0)
#define CAN_TDT2R_DLC_0     (0x1U<<0)
#define CAN_TDT2R_TGT       (0x1U<<8)
#define CAN_TDT2R_TIME      (0xFFFFU<<16)
#define CAN_TDT2R_TIME_0    (0x1U<<16)

// TDL2R Configuration

#define CAN_TDL2R_DATA0     (0xFFU<<0)
#define CAN_TDL2R_DATA0_0   (0x1U<<0)
#define CAN_TDL2R_DATA1     (0xFFU<<8)
#define CAN_TDL2R_DATA1_0   (0x1U<<8)
#define CAN_TDL2R_DATA2     (0xFFU<<16)
#define CAN_TDL2R_DATA2_0   (0x1U<<16)
#define CAN_TDL2R_DATA3     (0xFFU<<24)
#define CAN_TDL2R_DATA3_0   (0x1U<<24)

// TDH2R Configuration

#define CAN_TDH2R_DATA4     (0xFFU<<0)
#define CAN_TDH2R_DATA4_0   (0x1U<<0)
#define CAN_TDH2R_DATA5     (0xFFU<<8)
#define CAN_TDH2R_DATA5_0   (0x1U<<8)
#define CAN_TDH2R_DATA6     (0xFFU<<16)
#define CAN_TDH2R_DATA6_0   (0x1U<<16)
#define CAN_TDH2R_DATA7     (0xFFU<<24)
#define CAN_TDH2R_DATA7_0   (0x1U<<24)

// RI0R Configuration

#define CAN_RI0R_RTR        (0x1U<<1)
#define CAN_RI0R_IDE        (0x1U<<2)
#define CAN_RI0R_EXID       (0x3FFFFU<<3)
#define CAN_RI0R_EXID_0     (0x1U<<3)
#define CAN_RI0R_STID       (0x7FFU<<21)
#define CAN_RI0R_STID_0     (0x1U<<21)

// RDT0R Configuration

#define CAN_RDT0R_DLC       (0xFU<<0)
#define CAN_RDT0R_DLC_0     (0x1U<<0)
#define CAN_RDT0R_FMI       (0xFFU<<8)
#define CAN_RDT0R_FMI_0     (0x1U<<8)
#define CAN_RDT0R_TIME      (0xFFFFU<<16)
#define CAN_RDT0R_TIME_0    (0x1U<<16)

// RDL0R Configuration

#define CAN_RDL0R_DATA0     (0xFFU<<0)
#define CAN_RDL0R_DATA0_0   (0x1U<<0)
#define CAN_RDL0R_DATA1     (0xFFU<<8)
#define CAN_RDL0R_DATA1_0   (0x1U<<8)
#define CAN_RDL0R_DATA2     (0xFFU<<16)
#define CAN_RDL0R_DATA2_0   (0x1U<<16)
#define CAN_RDL0R_DATA3     (0xFFU<<24)
#define CAN_RDL0R_DATA3_0   (0x1U<<24)

// RDH0R Configuration

#define CAN_RDH0R_DATA4     (0xFFU<<0)
#define CAN_RDH0R_DATA4_0   (0x1U<<0)
#define CAN_RDH0R_DATA5     (0xFFU<<8)
#define CAN_RDH0R_DATA5_0   (0x1U<<8)
#define CAN_RDH0R_DATA6     (0xFFU<<16)
#define CAN_RDH0R_DATA6_0   (0x1U<<16)
#define CAN_RDH0R_DATA7     (0xFFU<<24)
#define CAN_RDH0R_DATA7_0   (0x1U<<24)

// RI1R Configuration

#define CAN_RI1R_RTR        (0x1U<<1)
#define CAN_RI1R_IDE        (0x1U<<2)
#define CAN_RI1R_EXID       (0x3FFFFU<<3)
#define CAN_RI1R_EXID_0     (0x1U<<3)
#define CAN_RI1R_STID       (0x7FFU<<21)
#define CAN_RI1R_STID_0     (0x1U<<21)

// RDT1R Configuration

#define CAN_RDT1R_DLC       (0xFU<<0)
#define CAN_RDT1R_DLC_0     (0x1U<<0)
#define CAN_RDT1R_FMI       (0xFFU<<8)
#define CAN_RDT1R_FMI_0     (0x1U<<8)
#define CAN_RDT1R_TIME      (0xFFFFU<<16)
#define CAN_RDT1R_TIME_0    (0x1U<<16)

// RDL1R Configuration

#define CAN_RDL1R_DATA0     (0xFFU<<0)
#define CAN_RDL1R_DATA0_0   (0x1U<<0)
#define CAN_RDL1R_DATA1     (0xFFU<<8)
#define CAN_RDL1R_DATA1_0   (0x1U<<8)
#define CAN_RDL1R_DATA2     (0xFFU<<16)
#define CAN_RDL1R_DATA2_0   (0x1U<<16)
#define CAN_RDL1R_DATA3     (0xFFU<<24)
#define CAN_RDL1R_DATA3_0   (0x1U<<24)

