Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32F207/Includes/Registers/stm32F217_can.h
// RDH1R Configuration

#define CAN_RDH1R_DATA4     (0xFFU<<0)
#define CAN_RDH1R_DATA4_0   (0x1U<<0)
#define CAN_RDH1R_DATA5     (0xFFU<<8)
#define CAN_RDH1R_DATA5_0   (0x1U<<8)
#define CAN_RDH1R_DATA6     (0xFFU<<16)
#define CAN_RDH1R_DATA6_0   (0x1U<<16)
#define CAN_RDH1R_DATA7     (0xFFU<<24)
#define CAN_RDH1R_DATA7_0   (0x1U<<24)

// FMR Configuration

#define CAN_FMR_FINIT       (0x1U<<0)
#define CAN_FMR_CAN2SB      (0x3FU<<8)
#define CAN_FMR_CAN2SB_0    (0x1U<<8)

// FM1R Configuration

#define CAN_FM1R_FBM27      (0x1U<<27)
#define CAN_FM1R_FBM26      (0x1U<<26)
#define CAN_FM1R_FBM25      (0x1U<<25)
#define CAN_FM1R_FBM24      (0x1U<<24)
#define CAN_FM1R_FBM23      (0x1U<<23)
#define CAN_FM1R_FBM22      (0x1U<<22)
#define CAN_FM1R_FBM21      (0x1U<<21)
#define CAN_FM1R_FBM20      (0x1U<<20)
#define CAN_FM1R_FBM19      (0x1U<<19)
#define CAN_FM1R_FBM18      (0x1U<<18)
#define CAN_FM1R_FBM17      (0x1U<<17)
#define CAN_FM1R_FBM16      (0x1U<<16)
#define CAN_FM1R_FBM15      (0x1U<<15)
#define CAN_FM1R_FBM14      (0x1U<<14)
#define CAN_FM1R_FBM13      (0x1U<<13)
#define CAN_FM1R_FBM12      (0x1U<<12)
#define CAN_FM1R_FBM11      (0x1U<<11)
#define CAN_FM1R_FBM10      (0x1U<<10)
#define CAN_FM1R_FBM9       (0x1U<<9)
#define CAN_FM1R_FBM8       (0x1U<<8)
#define CAN_FM1R_FBM7       (0x1U<<7)
#define CAN_FM1R_FBM6       (0x1U<<6)
#define CAN_FM1R_FBM5       (0x1U<<5)
#define CAN_FM1R_FBM4       (0x1U<<4)
#define CAN_FM1R_FBM3       (0x1U<<3)
#define CAN_FM1R_FBM2       (0x1U<<2)
#define CAN_FM1R_FBM1       (0x1U<<1)
#define CAN_FM1R_FBM0       (0x1U<<0)

// FS1R Configuration

#define CAN_FS1R_FSC27      (0x1U<<27)
#define CAN_FS1R_FSC26      (0x1U<<26)
#define CAN_FS1R_FSC25      (0x1U<<25)
#define CAN_FS1R_FSC24      (0x1U<<24)
#define CAN_FS1R_FSC23      (0x1U<<23)
#define CAN_FS1R_FSC22      (0x1U<<22)
#define CAN_FS1R_FSC21      (0x1U<<21)
#define CAN_FS1R_FSC20      (0x1U<<20)
#define CAN_FS1R_FSC19      (0x1U<<19)
#define CAN_FS1R_FSC18      (0x1U<<18)
#define CAN_FS1R_FSC17      (0x1U<<17)
#define CAN_FS1R_FSC16      (0x1U<<16)
#define CAN_FS1R_FSC15      (0x1U<<15)
#define CAN_FS1R_FSC14      (0x1U<<14)
#define CAN_FS1R_FSC13      (0x1U<<13)
#define CAN_FS1R_FSC12      (0x1U<<12)
#define CAN_FS1R_FSC11      (0x1U<<11)
#define CAN_FS1R_FSC10      (0x1U<<10)
#define CAN_FS1R_FSC9       (0x1U<<9)
#define CAN_FS1R_FSC8       (0x1U<<8)
#define CAN_FS1R_FSC7       (0x1U<<7)
#define CAN_FS1R_FSC6       (0x1U<<6)
#define CAN_FS1R_FSC5       (0x1U<<5)
#define CAN_FS1R_FSC4       (0x1U<<4)
#define CAN_FS1R_FSC3       (0x1U<<3)
#define CAN_FS1R_FSC2       (0x1U<<2)
#define CAN_FS1R_FSC1       (0x1U<<1)
#define CAN_FS1R_FSC0       (0x1U<<0)

// FFA1R Configuration

#define CAN_FFA1R_FFA27     (0x1U<<27)
#define CAN_FFA1R_FFA26     (0x1U<<26)
#define CAN_FFA1R_FFA25     (0x1U<<25)
#define CAN_FFA1R_FFA24     (0x1U<<24)
#define CAN_FFA1R_FFA23     (0x1U<<23)
#define CAN_FFA1R_FFA22     (0x1U<<22)
#define CAN_FFA1R_FFA21     (0x1U<<21)
#define CAN_FFA1R_FFA20     (0x1U<<20)
#define CAN_FFA1R_FFA19     (0x1U<<19)
#define CAN_FFA1R_FFA18     (0x1U<<18)
#define CAN_FFA1R_FFA17     (0x1U<<17)
#define CAN_FFA1R_FFA16     (0x1U<<16)
#define CAN_FFA1R_FFA15     (0x1U<<15)
#define CAN_FFA1R_FFA14     (0x1U<<14)
#define CAN_FFA1R_FFA13     (0x1U<<13)
#define CAN_FFA1R_FFA12     (0x1U<<12)
#define CAN_FFA1R_FFA11     (0x1U<<11)
#define CAN_FFA1R_FFA10     (0x1U<<10)
#define CAN_FFA1R_FFA9      (0x1U<<9)
#define CAN_FFA1R_FFA8      (0x1U<<8)
#define CAN_FFA1R_FFA7      (0x1U<<7)
#define CAN_FFA1R_FFA6      (0x1U<<6)
#define CAN_FFA1R_FFA5      (0x1U<<5)
#define CAN_FFA1R_FFA4      (0x1U<<4)
#define CAN_FFA1R_FFA3      (0x1U<<3)
#define CAN_FFA1R_FFA2      (0x1U<<2)
#define CAN_FFA1R_FFA1      (0x1U<<1)
#define CAN_FFA1R_FFA0      (0x1U<<0)

// FA1R Configuration

#define CAN_FA1R_FACT27     (0x1U<<27)
#define CAN_FA1R_FACT26     (0x1U<<26)
#define CAN_FA1R_FACT25     (0x1U<<25)
#define CAN_FA1R_FACT24     (0x1U<<24)
#define CAN_FA1R_FACT23     (0x1U<<23)
#define CAN_FA1R_FACT22     (0x1U<<22)
#define CAN_FA1R_FACT21     (0x1U<<21)
#define CAN_FA1R_FACT20     (0x1U<<20)
#define CAN_FA1R_FACT19     (0x1U<<19)
#define CAN_FA1R_FACT18     (0x1U<<18)
#define CAN_FA1R_FACT17     (0x1U<<17)
#define CAN_FA1R_FACT16     (0x1U<<16)
#define CAN_FA1R_FACT15     (0x1U<<15)
#define CAN_FA1R_FACT14     (0x1U<<14)
#define CAN_FA1R_FACT13     (0x1U<<13)
#define CAN_FA1R_FACT12     (0x1U<<12)
#define CAN_FA1R_FACT11     (0x1U<<11)
#define CAN_FA1R_FACT10     (0x1U<<10)
#define CAN_FA1R_FACT9      (0x1U<<9)
#define CAN_FA1R_FACT8      (0x1U<<8)
#define CAN_FA1R_FACT7      (0x1U<<7)
#define CAN_FA1R_FACT6      (0x1U<<6)
#define CAN_FA1R_FACT5      (0x1U<<5)
#define CAN_FA1R_FACT4      (0x1U<<4)
#define CAN_FA1R_FACT3      (0x1U<<3)
#define CAN_FA1R_FACT2      (0x1U<<2)
#define CAN_FA1R_FACT1      (0x1U<<1)
#define CAN_FA1R_FACT0      (0x1U<<0)

// F0R1 Configuration

#define CAN_F0R1_FB31       (0x1U<<31)
#define CAN_F0R1_FB30       (0x1U<<30)
#define CAN_F0R1_FB29       (0x1U<<29)
#define CAN_F0R1_FB28       (0x1U<<28)
#define CAN_F0R1_FB27       (0x1U<<27)
#define CAN_F0R1_FB26       (0x1U<<26)
#define CAN_F0R1_FB25       (0x1U<<25)
#define CAN_F0R1_FB24       (0x1U<<24)
#define CAN_F0R1_FB23       (0x1U<<23)
#define CAN_F0R1_FB22       (0x1U<<22)
#define CAN_F0R1_FB21       (0x1U<<21)
#define CAN_F0R1_FB20       (0x1U<<20)
#define CAN_F0R1_FB19       (0x1U<<19)
#define CAN_F0R1_FB18       (0x1U<<18)
#define CAN_F0R1_FB17       (0x1U<<17)
#define CAN_F0R1_FB16       (0x1U<<16)
#define CAN_F0R1_FB15       (0x1U<<15)
#define CAN_F0R1_FB14       (0x1U<<14)
#define CAN_F0R1_FB13       (0x1U<<13)
#define CAN_F0R1_FB12       (0x1U<<12)
#define CAN_F0R1_FB11       (0x1U<<11)
#define CAN_F0R1_FB10       (0x1U<<10)
#define CAN_F0R1_FB9        (0x1U<<9)
#define CAN_F0R1_FB8        (0x1U<<8)
#define CAN_F0R1_FB7        (0x1U<<7)
#define CAN_F0R1_FB6        (0x1U<<6)
#define CAN_F0R1_FB5        (0x1U<<5)
#define CAN_F0R1_FB4        (0x1U<<4)
#define CAN_F0R1_FB3        (0x1U<<3)
#define CAN_F0R1_FB2        (0x1U<<2)
#define CAN_F0R1_FB1        (0x1U<<1)
#define CAN_F0R1_FB0        (0x1U<<0)

// F0R2 Configuration

