Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32F207/Includes/Registers/stm32F217_can.h
#define CAN_F21R2_FB31      (0x1U<<31)
#define CAN_F21R2_FB30      (0x1U<<30)
#define CAN_F21R2_FB29      (0x1U<<29)
#define CAN_F21R2_FB28      (0x1U<<28)
#define CAN_F21R2_FB27      (0x1U<<27)
#define CAN_F21R2_FB26      (0x1U<<26)
#define CAN_F21R2_FB25      (0x1U<<25)
#define CAN_F21R2_FB24      (0x1U<<24)
#define CAN_F21R2_FB23      (0x1U<<23)
#define CAN_F21R2_FB22      (0x1U<<22)
#define CAN_F21R2_FB21      (0x1U<<21)
#define CAN_F21R2_FB20      (0x1U<<20)
#define CAN_F21R2_FB19      (0x1U<<19)
#define CAN_F21R2_FB18      (0x1U<<18)
#define CAN_F21R2_FB17      (0x1U<<17)
#define CAN_F21R2_FB16      (0x1U<<16)
#define CAN_F21R2_FB15      (0x1U<<15)
#define CAN_F21R2_FB14      (0x1U<<14)
#define CAN_F21R2_FB13      (0x1U<<13)
#define CAN_F21R2_FB12      (0x1U<<12)
#define CAN_F21R2_FB11      (0x1U<<11)
#define CAN_F21R2_FB10      (0x1U<<10)
#define CAN_F21R2_FB9       (0x1U<<9)
#define CAN_F21R2_FB8       (0x1U<<8)
#define CAN_F21R2_FB7       (0x1U<<7)
#define CAN_F21R2_FB6       (0x1U<<6)
#define CAN_F21R2_FB5       (0x1U<<5)
#define CAN_F21R2_FB4       (0x1U<<4)
#define CAN_F21R2_FB3       (0x1U<<3)
#define CAN_F21R2_FB2       (0x1U<<2)
#define CAN_F21R2_FB1       (0x1U<<1)
#define CAN_F21R2_FB0       (0x1U<<0)

// F22R1 Configuration

#define CAN_F22R1_FB31      (0x1U<<31)
#define CAN_F22R1_FB30      (0x1U<<30)
#define CAN_F22R1_FB29      (0x1U<<29)
#define CAN_F22R1_FB28      (0x1U<<28)
#define CAN_F22R1_FB27      (0x1U<<27)
#define CAN_F22R1_FB26      (0x1U<<26)
#define CAN_F22R1_FB25      (0x1U<<25)
#define CAN_F22R1_FB24      (0x1U<<24)
#define CAN_F22R1_FB23      (0x1U<<23)
#define CAN_F22R1_FB22      (0x1U<<22)
#define CAN_F22R1_FB21      (0x1U<<21)
#define CAN_F22R1_FB20      (0x1U<<20)
#define CAN_F22R1_FB19      (0x1U<<19)
#define CAN_F22R1_FB18      (0x1U<<18)
#define CAN_F22R1_FB17      (0x1U<<17)
#define CAN_F22R1_FB16      (0x1U<<16)
#define CAN_F22R1_FB15      (0x1U<<15)
#define CAN_F22R1_FB14      (0x1U<<14)
#define CAN_F22R1_FB13      (0x1U<<13)
#define CAN_F22R1_FB12      (0x1U<<12)
#define CAN_F22R1_FB11      (0x1U<<11)
#define CAN_F22R1_FB10      (0x1U<<10)
#define CAN_F22R1_FB9       (0x1U<<9)
#define CAN_F22R1_FB8       (0x1U<<8)
#define CAN_F22R1_FB7       (0x1U<<7)
#define CAN_F22R1_FB6       (0x1U<<6)
#define CAN_F22R1_FB5       (0x1U<<5)
#define CAN_F22R1_FB4       (0x1U<<4)
#define CAN_F22R1_FB3       (0x1U<<3)
#define CAN_F22R1_FB2       (0x1U<<2)
#define CAN_F22R1_FB1       (0x1U<<1)
#define CAN_F22R1_FB0       (0x1U<<0)

// F22R2 Configuration

#define CAN_F22R2_FB31      (0x1U<<31)
#define CAN_F22R2_FB30      (0x1U<<30)
#define CAN_F22R2_FB29      (0x1U<<29)
#define CAN_F22R2_FB28      (0x1U<<28)
#define CAN_F22R2_FB27      (0x1U<<27)
#define CAN_F22R2_FB26      (0x1U<<26)
#define CAN_F22R2_FB25      (0x1U<<25)
#define CAN_F22R2_FB24      (0x1U<<24)
#define CAN_F22R2_FB23      (0x1U<<23)
#define CAN_F22R2_FB22      (0x1U<<22)
#define CAN_F22R2_FB21      (0x1U<<21)
#define CAN_F22R2_FB20      (0x1U<<20)
#define CAN_F22R2_FB19      (0x1U<<19)
#define CAN_F22R2_FB18      (0x1U<<18)
#define CAN_F22R2_FB17      (0x1U<<17)
#define CAN_F22R2_FB16      (0x1U<<16)
#define CAN_F22R2_FB15      (0x1U<<15)
#define CAN_F22R2_FB14      (0x1U<<14)
#define CAN_F22R2_FB13      (0x1U<<13)
#define CAN_F22R2_FB12      (0x1U<<12)
#define CAN_F22R2_FB11      (0x1U<<11)
#define CAN_F22R2_FB10      (0x1U<<10)
#define CAN_F22R2_FB9       (0x1U<<9)
#define CAN_F22R2_FB8       (0x1U<<8)
#define CAN_F22R2_FB7       (0x1U<<7)
#define CAN_F22R2_FB6       (0x1U<<6)
#define CAN_F22R2_FB5       (0x1U<<5)
#define CAN_F22R2_FB4       (0x1U<<4)
#define CAN_F22R2_FB3       (0x1U<<3)
#define CAN_F22R2_FB2       (0x1U<<2)
#define CAN_F22R2_FB1       (0x1U<<1)
#define CAN_F22R2_FB0       (0x1U<<0)

// F23R1 Configuration

#define CAN_F23R1_FB31      (0x1U<<31)
#define CAN_F23R1_FB30      (0x1U<<30)
#define CAN_F23R1_FB29      (0x1U<<29)
#define CAN_F23R1_FB28      (0x1U<<28)
#define CAN_F23R1_FB27      (0x1U<<27)
#define CAN_F23R1_FB26      (0x1U<<26)
#define CAN_F23R1_FB25      (0x1U<<25)
#define CAN_F23R1_FB24      (0x1U<<24)
#define CAN_F23R1_FB23      (0x1U<<23)
#define CAN_F23R1_FB22      (0x1U<<22)
#define CAN_F23R1_FB21      (0x1U<<21)
#define CAN_F23R1_FB20      (0x1U<<20)
#define CAN_F23R1_FB19      (0x1U<<19)
#define CAN_F23R1_FB18      (0x1U<<18)
#define CAN_F23R1_FB17      (0x1U<<17)
#define CAN_F23R1_FB16      (0x1U<<16)
#define CAN_F23R1_FB15      (0x1U<<15)
#define CAN_F23R1_FB14      (0x1U<<14)
#define CAN_F23R1_FB13      (0x1U<<13)
#define CAN_F23R1_FB12      (0x1U<<12)
#define CAN_F23R1_FB11      (0x1U<<11)
#define CAN_F23R1_FB10      (0x1U<<10)
#define CAN_F23R1_FB9       (0x1U<<9)
#define CAN_F23R1_FB8       (0x1U<<8)
#define CAN_F23R1_FB7       (0x1U<<7)
#define CAN_F23R1_FB6       (0x1U<<6)
#define CAN_F23R1_FB5       (0x1U<<5)
#define CAN_F23R1_FB4       (0x1U<<4)
#define CAN_F23R1_FB3       (0x1U<<3)
#define CAN_F23R1_FB2       (0x1U<<2)
#define CAN_F23R1_FB1       (0x1U<<1)
#define CAN_F23R1_FB0       (0x1U<<0)

// F23R2 Configuration

#define CAN_F23R2_FB31      (0x1U<<31)
#define CAN_F23R2_FB30      (0x1U<<30)
#define CAN_F23R2_FB29      (0x1U<<29)
#define CAN_F23R2_FB28      (0x1U<<28)
#define CAN_F23R2_FB27      (0x1U<<27)
#define CAN_F23R2_FB26      (0x1U<<26)
#define CAN_F23R2_FB25      (0x1U<<25)
#define CAN_F23R2_FB24      (0x1U<<24)
#define CAN_F23R2_FB23      (0x1U<<23)
#define CAN_F23R2_FB22      (0x1U<<22)
#define CAN_F23R2_FB21      (0x1U<<21)
#define CAN_F23R2_FB20      (0x1U<<20)
#define CAN_F23R2_FB19      (0x1U<<19)
#define CAN_F23R2_FB18      (0x1U<<18)
#define CAN_F23R2_FB17      (0x1U<<17)
#define CAN_F23R2_FB16      (0x1U<<16)
#define CAN_F23R2_FB15      (0x1U<<15)
#define CAN_F23R2_FB14      (0x1U<<14)
#define CAN_F23R2_FB13      (0x1U<<13)
#define CAN_F23R2_FB12      (0x1U<<12)
#define CAN_F23R2_FB11      (0x1U<<11)
#define CAN_F23R2_FB10      (0x1U<<10)
#define CAN_F23R2_FB9       (0x1U<<9)
#define CAN_F23R2_FB8       (0x1U<<8)
#define CAN_F23R2_FB7       (0x1U<<7)
#define CAN_F23R2_FB6       (0x1U<<6)
#define CAN_F23R2_FB5       (0x1U<<5)
#define CAN_F23R2_FB4       (0x1U<<4)
#define CAN_F23R2_FB3       (0x1U<<3)
#define CAN_F23R2_FB2       (0x1U<<2)
#define CAN_F23R2_FB1       (0x1U<<1)
#define CAN_F23R2_FB0       (0x1U<<0)

